["Chuck Norris once screamed \"bloody murder\" in sign language for the hearing impaired.","Chuck Norris is the only man who can live with and without women.","Davy Crockett shot his first bear when he was only 3. Chuck Norris roundhouse kicked his first bear into oblivion when he was only 6 months old.","Chuck Norris died years ago death was to scared to tell him","Once a grizzly bear threatened to eat Chuck Norris. Chuck showed the bear his fist and the bear proceeded to eat himself, because it would be the less painful way to die.","Chuck Norris lost both his legs in a car accident....and still managed to walk it off","Chuck Norris once used the Grim Reaper as a Sherper up Everest but Roundhouse kicked him in the Death Zone and summitted ALONE","Chuck Norris is like a dog, not only because he can smell fear, but because he can piss on whatever he wants.","Chuck Norris can text/watch videos/surf the web.... on a payphone.","In response to the recent Ice Bucket Challenge that is trending worldwide, Chuck Norris invented a version of his own. Simply called the \"Bucket Challenge,\" you donate money to Chuck Norris or he repeatedly throws buckets at you until you give in.","When Chuck Norris has nasal congestion, his dried snot is so rigid that it requires a duech bag infusion rather than a nose drops remedy.","Chuck Norris once sang \"Twinkle, Twinkle, Little Star\" at a karaoke bar. Understandably, there were no survivors.","Chuck Norris never needs toilet paper to wipe his ass,his Godly ass wipes it himself.","Wanna know what happened to Jimmy Hoffa? Chuck Norris happened.","Chuck Norris likes Apples for dessert ... especially Macbook Pros and Airbooks","Sure, you can beat eggs, you can beat a drum, you can beat your wife & kids, you can even beat your meat. But you can't beat Chuck Norris at anything.","Chuck Norris created Stephen Hawking during a bowel movement,","Chuck Norris' earwax is used by the U.S. Airforce as the radar deflecting final polish on the B-2 Spirit stealth bombers.","Chuck Norris created \"Where's Waldo?\". He wasn't a fan of the name Waldo, so he round house kicked him in the face and no one has seen Waldo since...hence where's Waldo?","Chuck Norris is the reason Usain Bolt can run so fast."]